{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Metadata describing Valentine share-button features and associated files.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference.",
  "frontend/index.css": "Global Tailwind base setup with light/dark OKLCH color tokens and theme variables.",
  "frontend/index.html": "HTML entry point loading the React app and setting the Valentine page title.",
  "frontend/src/App.tsx": "Wraps the proposal screen in RomanticLayout and toggles success state on yes click.",
  "frontend/src/components/animations/ConfettiHeartsBurst.tsx": "Generates 20 animated heart particles for a confetti burst effect.",
  "frontend/src/components/animations/FinalRomanticCelebration.tsx": "Generates 40 falling heart and sparkle particles for final celebration.",
  "frontend/src/components/animations/FloatingHeartsBackground.tsx": "Creates slow-floating background heart animations.",
  "frontend/src/components/animations/SparkleBurst.tsx": "Displays sparkle particles for special effect bursts.",
  "frontend/src/components/AudioToggle.tsx": "Button that toggles global audio using shared audio context.",
  "frontend/src/components/RomanticLayout.tsx": "App layout providing floating hearts background, audio provider, and footer attribution.",
  "frontend/src/components/screens/FinalCelebrationScreen.tsx": "Final screen with celebration animations, restart button, and share option.",
  "frontend/src/components/screens/QuizScreen.tsx": "Renders the quiz flow with question navigation, answer selection, scoring, sound effects, and celebration animations.",
  "frontend/src/components/screens/ResultPerfectScreen.tsx": "Displays the perfect score screen with trophy visuals, a redeemable date coupon, and restart/share options.",
  "frontend/src/components/screens/ResultTeaseScreen.tsx": "Shows a teasing result screen with dynamic yes/no button behavior and prompts based on the user's score and interactions.",
  "frontend/src/components/screens/ValentineProposalScreen.tsx": "Handles the Valentine proposal interaction, including a moving 'No' button and a success screen with animations and sharing.",
  "frontend/src/components/screens/WelcomeScreen.tsx": "Presents the intro screen with themed visuals, a start button, and a share option for entering the quiz.",
  "frontend/src/components/ShareButton.tsx": "Share button that copies current URL and shows a Valentine-themed toast.",
  "frontend/src/context/AudioControllerContext.tsx": "Provides global audio control, initializing and managing background music and multiple sound effects.",
  "frontend/src/data/loveQuizQuestions.ts": "Defines the quiz question list with options and correct answers used throughout the app.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useAudioController.ts": "Initializes background music and sound effects and exposes controls to toggle audio and play specific SFX.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity auth, managing login, stored identities, and status flags.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom romantic-themed colors, utilities, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, shadows, and plugins for the romantic theme.",
  "project_state.json": "Stores project metadata, requirements, known issues, and architectural notes for the Valentine quiz app."
}