{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report listing Valentine-related audio and proposal-screen features with affected files and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of multiple frontend components and assets.",
  "frontend/index.css": "Tailwind base config defining theme variables, dark mode tokens, and global background/foreground styling.",
  "frontend/index.html": "HTML entry point setting page title and loading the React main module.",
  "frontend/src/App.tsx": "Root component rendering RomanticLayout with the ValentineProposalScreen and Toaster.",
  "frontend/src/components/animations/ConfettiHeartsBurst.tsx": "Generates 20 randomized heart particles for a confetti burst effect.",
  "frontend/src/components/animations/FinalRomanticCelebration.tsx": "Creates 40 falling heart and sparkle particles with randomized timing for a final celebration animation.",
  "frontend/src/components/animations/FloatingHeartsBackground.tsx": "Renders 15 slow-floating heart elements for ambient background motion.",
  "frontend/src/components/animations/SparkleBurst.tsx": "Generates 12 randomized sparkles for a centered burst animation.",
  "frontend/src/components/AudioToggle.tsx": "Audio toggle button interacting with shared audio context to enable or disable sound.",
  "frontend/src/components/RomanticLayout.tsx": "Layout wrapper providing romantic background, audio provider, audio toggle, and footer attribution.",
  "frontend/src/components/screens/FinalCelebrationScreen.tsx": "Final victory screen with celebratory animations, messages, restart button, and share option.",
  "frontend/src/components/screens/QuizScreen.tsx": "Renders the quiz flow with progress, answer handling, sound effects, and celebration animations before returning a final score.",
  "frontend/src/components/screens/ResultPerfectScreen.tsx": "Displays the perfect-score screen with celebratory visuals, a redeemable date coupon, and restart/sharing options.",
  "frontend/src/components/screens/ResultTeaseScreen.tsx": "Shows a teasing results screen that adjusts Yes/No button sizes dynamically and prompts the user to accept the Valentine request.",
  "frontend/src/components/screens/ValentineProposalScreen.tsx": "Presents a Valentine proposal with a moving No button and a confirmation state that plays a sound and shows a success message.",
  "frontend/src/components/screens/WelcomeScreen.tsx": "Provides the introductory screen with a start button and sharing option for beginning the quiz.",
  "frontend/src/components/ShareButton.tsx": "Share button that copies the current URL to the clipboard and shows toast feedback.",
  "frontend/src/context/AudioControllerContext.tsx": "Manages global audio state, background music, and multiple sound effects with enable/disable controls.",
  "frontend/src/data/loveQuizQuestions.ts": "Contains the quiz question data, including prompts, answer choices, and correct answers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes related queries when the identity changes.",
  "frontend/src/hooks/useAudioController.ts": "Initializes background music and sound effects and provides functions to toggle audio and play specific sounds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity loading using Dfinity AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom romantic-themed color variables, utilities, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, shadows, animations, and plugins using CSS variables.",
  "project_state.json": "Stores project metadata, requirements, features, and architectural notes for the romantic quiz app."
}