{
  "kind": "build_request",
  "title": "Add romantic background song and tiny harp sound effect to the Valentine page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Add a tiny romantic harp sound effect and play it when the user clicks/taps the “Yes! 💕” button on the Valentine proposal screen, but only when audio is enabled via the existing audio toggle (audio must remain off by default until enabled).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-yes-pls-try-add-song"
        ],
        "quotes": [
          "Yes pls try to add the song"
        ]
      },
      "acceptanceCriteria": [
        "With audio toggle OFF, tapping “Yes! 💕” does not play any sound.",
        "With audio toggle ON, tapping “Yes! 💕” plays a short “tiny romantic harp” sound once per tap (no overlap beyond expected rapid taps).",
        "The harp sound effect is loaded from a local static asset under frontend/public/assets/audio (no external URLs).",
        "Behavior works on iPad Chrome using a tap/click interaction (no reliance on hover)."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Ensure the romantic background song (looping background music) is present as a local static audio asset and is used by the existing audio controller so that when the user enables audio, the background song starts playing and loops; when audio is disabled, it stops.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-yes-pls-try-add-song"
        ],
        "quotes": [
          "Yes pls try to add the song"
        ]
      },
      "acceptanceCriteria": [
        "A background music file exists at the path expected by the app (currently /assets/audio/romantic-bg.mp3) under frontend/public/assets/audio.",
        "Toggling audio ON starts background playback (subject to browser autoplay rules; must work after user interaction).",
        "Toggling audio OFF pauses background playback.",
        "No external audio fetches are used."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Wire the Valentine proposal screen to the audio system so the “Yes” click can trigger the harp SFX without duplicating independent audio controller state across components.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-yes-pls-try-add-song"
        ],
        "quotes": [
          "Yes pls try to add the song"
        ]
      },
      "acceptanceCriteria": [
        "The ValentineProposalScreen “Yes” action triggers the harp SFX through the same enabled/disabled state controlled by the top-right AudioToggle.",
        "There is a single source of truth for audio enabled state for the page (toggling the AudioToggle reliably affects whether the “Yes” SFX plays)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only UI component sources).",
    "Do not fetch audio from external URLs; audio must be served as local static assets (e.g., under frontend/public/assets/audio).",
    "Audio must be off by default until the user enables it via the existing audio toggle.",
    "Maintain compatibility with iPad Chrome (tap-first interactions; avoid hover-only behavior for audio)."
  ],
  "nonGoals": [
    "Adding new authentication flows (Internet Identity) or requiring login to use the page.",
    "Backend changes in Motoko (this request should be implementable purely on the frontend with static assets).",
    "Adding additional new UI screens beyond wiring audio into the existing Valentine proposal flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}