{
  "kind": "build_request",
  "title": "Add Share button to the Valentine proposal page (and fix Share toast copy)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "Render a visible, tap-friendly \"Share\" button on the Valentine proposal screen (the \"Will You Be My Valentine?\" view) that copies the current page URL to the clipboard and shows a confirmation toast.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Give the share button in it"
        ]
      },
      "acceptanceCriteria": [
        "On the Valentine proposal screen, a clearly visible \"Share\" button is present without requiring any login.",
        "Tapping/clicking the Share button copies window.location.href to the clipboard.",
        "After copying succeeds, a toast confirmation is shown to the user.",
        "The Share button is usable on iPad Chrome (comfortable tap target, no hover required)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Render the same \"Share\" button on the Valentine proposal confirmation view (the \"Good Choice\" success view shown after tapping \"Yes! 💕\").",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Give the share button in it"
        ]
      },
      "acceptanceCriteria": [
        "After tapping \"Yes! 💕\" and entering the \"Good Choice\" view, a \"Share\" button is visible and functional.",
        "The Share button on the success view copies the current page URL and shows the same confirmation toast behavior."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Update the Share button toast text so it accurately references sharing the Valentine page (not a quiz), using English user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Give the share button in it"
        ]
      },
      "acceptanceCriteria": [
        "On successful copy, the toast title remains in English and the toast description does not mention \"quiz\".",
        "On copy failure, the error toast remains in English and instructs the user to try again or copy the URL manually."
      ]
    }
  ],
  "constraints": [
    "Do not fetch or render external images/URLs for sharing; sharing must copy the current page URL to the clipboard.",
    "Do not modify any files under frontend/src/components/ui (these are immutable vendor UI components).",
    "Keep the app accessible without authentication; the share interaction must work for anonymous users."
  ],
  "nonGoals": [
    "Adding social-network-specific share integrations (e.g., Facebook/Twitter share APIs).",
    "Adding backend endpoints or persistence related to sharing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}