{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Share button to Valentine proposal + success views and fix toast copy",
  "requirements": [
    {
      "id": "REQ-30",
      "summary": "Add a visible, tap-friendly Share button to the Valentine proposal screen that copies the current URL and shows a toast confirmation.",
      "acceptanceCriteria": [
        "On the Valentine proposal screen, a clearly visible \"Share\" button is present without requiring any login.",
        "Tapping/clicking the Share button copies window.location.href to the clipboard.",
        "After copying succeeds, a toast confirmation is shown to the user.",
        "The Share button is usable on iPad Chrome (comfortable tap target, no hover required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/screens/ValentineProposalScreen.tsx",
          "operation": "modify",
          "description": "Import and render the existing ShareButton on the \"Will You Be My Valentine?\" view (non-success state). Place it in a clearly visible location with layout classes that ensure a comfortable tap target on touch devices (no hover dependency). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Add the same Share button to the Valentine proposal confirmation (Good Choice) success view with identical copy+toast behavior.",
      "acceptanceCriteria": [
        "After tapping \"Yes! 💕\" and entering the \"Good Choice\" view, a \"Share\" button is visible and functional.",
        "The Share button on the success view copies the current page URL and shows the same confirmation toast behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/screens/ValentineProposalScreen.tsx",
          "operation": "modify",
          "description": "In the showSuccess (\"Good Choice\") render branch, import/render ShareButton with a prominent placement consistent with the success view content. Ensure it remains tap-friendly and uses the same toast behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Update Share button toast text to reference sharing the Valentine page (not a quiz) and keep success/failure messages in English with clear guidance on failure.",
      "acceptanceCriteria": [
        "On successful copy, the toast title remains in English and the toast description does not mention \"quiz\".",
        "On copy failure, the error toast remains in English and instructs the user to try again or copy the URL manually."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ShareButton.tsx",
          "operation": "modify",
          "description": "Update the success toast description to reference sharing the Valentine page (remove any mention of a quiz) and keep English user-facing strings. Keep/adjust failure toast copy in English to instruct retry or manual URL copy. Consider adding a safe clipboard fallback for iPad/iOS environments while still copying window.location.href (no external share integrations). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}